GetIS8752015
Syntax
SapObject.SapModel.LoadPatterns.AutoWind.GetIS8752015
VB6 Procedure
Function GetIS8752015(ByVal Name As String, ByRef ExposureFrom As Long, ByRef DirAngle As Double, ByRef Cpw As Double, ByRef Cpl As Double, ByRef UserZ As Boolean, ByRef TopZ As Double, ByRef BottomZ As Double, ByRef WindSpeed As Double, ByRef TerrainCategory As Long, ByRef ImportanceFactor As Long, ByRef k1 As Double, ByRef k3 As Double, ByRef UserExposure As Boolean) As Long
Parameters
Name
The name of an existing Wind-type load pattern with an Indian IS 875:2015 auto wind assignment.
ExposureFrom
This is either 1 or 2, indicating the source of the wind exposure.
1 = From extents of rigid diaphragms
2 = From area objects
DirAngle
The direction angle for the wind load. This item applies only when ExposureFrom = 1.
Cpw
The windward coefficient, Cp. This item applies only when ExposureFrom = 1.
Cpl
The leeward coefficient, Cp. This item applies only when ExposureFrom = 1.
UserZ
This item is True if the top and bottom elevations of the wind load are user specified. It is False if the elevations are determined by the program.
TopZ
This item applies only when the UserZ item is True. It is the global Z-coordinate at the highest level where auto wind loads are applied. [L]
BottomZ
This item applies only when the UserZ item is True. It is the global Z-coordinate at the lowest level where auto wind loads are applied. [L]
WindSpeed
The wind speed in meters per second.
TerrainCategory
This is 1, 2, 3 or 4, indicating the terrain category.
ImportanceFactor
This is 1, 2 or 3, depending on the importance factor.
1 = 1.00
2 = 1.15
3 = 1.30
k1
The risk coefficient (k1 factor).
k3
The topography factor (k3 factor).
UserExposure
If this item is True, the wind exposure widths are provided by the user. If it is False, the wind exposure widths are calculated by the program from the extents of the diaphragms.
Remarks
This function retrieves auto wind loading parameters for Indian IS875-2015.
The function returns zero if the parameters are successfully assigned; otherwise it returns a nonzero value.
VBA Example
Sub GetWindIS8752015()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim ExposureFrom As Long
 Dim DirAngle As Double
 Dim Cpw As Double
 Dim Cpl As Double
 Dim UserZ As Boolean
 Dim TopZ As Double
 Dim BottomZ As Double
 Dim WindSpeed As Double
 Dim TerrainCategory As Long
 Dim ImportanceFactor As Long
 Dim k1 As Double
 Dim k3 As Double
 Dim UserExposure As Boolean
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New3DFrame(BeamSlab, 2, 144, 3, 336, 2, 432)
 'define diaphragm constraints
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph1", Z)
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph2", Z)
 'assign points to diaphragm
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("2")
 ret = SapModel.PointObj.SetConstraint("", "Diaph1", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("3")
 ret = SapModel.PointObj.SetConstraint("", "Diaph2", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 'add new load pattern
 ret = SapModel.LoadPatterns.Add("WIND", LTYPE_WIND)
 'assign IS8752015 parameters
 ret = SapModel.LoadPatterns.AutoWind.SetIS8752015("WIND", 1, 0, 0.8, 0.5, False, 0, 0, 60, 3, 3, 1.1, 1.2)
 'get IS8752015 parameters
 ret = SapModel.LoadPatterns.AutoWind.GetIS8752015("WIND", ExposureFrom, DirAngle, Cpw, Cpl, UserZ, TopZ, BottomZ, WindSpeed, TerrainCategory, ImportanceFactor, k1, k3, UserExposure)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 19.2.0.
See Also
SetIS8752015